src/Documents/КАЗ_ПлатежноеПоручениеИсходящее/КАЗ_ПлатежноеПоручениеИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ПлатежноеПоручениеИсходящее</name>
  <registerRecords>AccumulationRegister.КАЗ_ФактическиеПлатежи</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ФактическиеПлатежи/КАЗ_ФактическиеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ФактическиеПлатежи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/КАЗ_СтатусыЗаявки/КАЗ_СтатусыЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_СтатусыЗаявки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВРеестре</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КАЗ_ПлатежноеПоручениеИсходящее/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не выбрана заявка на оплату.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СчетОрганизации) Тогда
		Сообщить("Не выбран банковский счет.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сумма <= 0 Тогда
		Сообщить("Сумма платежного поручения должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбъектЗаявки = Заявка.ПолучитьОбъект();

	Если ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена Тогда
		Сообщить("Заявка уже оплачена, повторная оплата невозможна.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ОбъектЗаявки.Статус <> Перечисления.КАЗ_СтатусыЗаявки.Согласована Тогда
		Сообщить("Оплата возможна только по согласованной заявке.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ФактическиеПлатежи.Записывать = Истина;

	Движение = Движения.КАЗ_ФактическиеПлатежи.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Заявка = Заявка;
	Движение.Контрагент = ОбъектЗаявки.Контрагент;
	Движение.Сумма = Сумма;

	ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена;
	ОбъектЗаявки.Записать();

КонецПроцедуры
